MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_pcd.c
  * @brief   PCD HAL module driver.
  *          This file provides firmware functions to manage the following
  *          features of the USB Peripheral Controller:
  *           + Initialization and deinitialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (USB_DRD_FS)
#if defined (USE_HAL_PCD_MODULE) && (USE_HAL_PCD_MODULE == 1)

/** @addtogroup PCD
  * @brief Peripheral Controller Driver, including the functions that allow the USB to be used in device mode.
  * @{
  */
/** @defgroup PCD_Introduction Introduction
  * @{

  USB Peripheral Controller Driver (PCD) hardware abstraction layer provides all required APIs to interface with the
  USB instance in device mode.
  It simplifies the initialization, configuration, and management of the USB depending on the user's required device
  function.

  This abstraction layer ensures portability and ease of use across different STM32 series. The PCD HAL abstracts
  different USB hardware instances that can be (depending on the STM32 MCU):
  * USB OTG FS (On-The-GO Full Speed)
  * USB OTG HS (On-The-GO High Speed)
  * USB DRD FS (Dual Role Device Full Speed)

  */
/**
  * @}
  */

/** @defgroup PCD_How_To_Use HAL How To Use
  * @{

  # How to use the HAL USB PCD module driver

  ## Use the USB Peripheral Controller Driver (PCD) HAL driver as follows:

  1. Declare a hal_pcd_handle_t handle structure, for example:
      hal_pcd_handle_t gh_pcd_usb_drd_fs;

  2. Initialize the USB PCD low-level resources:
    - USB PCD interface clock configuration:
      - Enable USB peripheral clock.

    - USB PCD interface power configuration:
      - Enable USB peripheral VddUSB power supply if applicable.

    - USB device pins configuration:
      USB data pins are automatically configured by the hardware during USB peripheral initialization;
      no additional user action is required.

    - NVIC configuration for interrupt handling with HAL_PCD_IRQHandler():
      - Set the USB PCD interrupt priority.
      - Enable the USB IRQ channel in the NVIC.

  3. Initialize the USB PCD driver with HAL_PCD_Init() by selecting an instance, for example:

     - HAL_PCD_Init(&gh_pcd_usb_drd_fs, HAL_PCD_DRD_FS);

  - Declare a hal_pcd_config_t structure, for example:
     - hal_pcd_config_t config_pcd_usb_drd_fs;

  - In the configuration structure,
    program the PHY interface, core speed, and other parameters as required.

  - Apply the configuration with:
     - HAL_PCD_SetConfig(&gh_pcd_usb_drd_fs, &config_pcd_usb_drd_fs);

  - Configure required USB device endpoints.

  ## USB PCD callback definitions:
  By default, all callbacks are initialized to their corresponding default weak functions.
  When the compilation define USE_HAL_PCD_REGISTER_CALLBACKS is set to 1U, configure the
  driver callbacks dynamically using the callback registration functions:

  | Default callback weak function                   | Callback registration function
  |--------------------------------------------------|------------------------------------------------------------------
  | HAL_PCD_SofCallback()                            | HAL_PCD_RegisterSofCallback()
  | HAL_PCD_SetupStageCallback()                     | HAL_PCD_RegisterSetupCallback()
  | HAL_PCD_ResetCallback()                          | HAL_PCD_RegisterResetCallback()
  | HAL_PCD_SuspendCallback()                        | HAL_PCD_RegisterSuspendCallback()
  | HAL_PCD_ResumeCallback()                         | HAL_PCD_RegisterResumeCallback()
  | HAL_PCD_ConnectCallback()                        | HAL_PCD_RegisterConnectCallback()
  | HAL_PCD_DisconnectCallback()                     | HAL_PCD_RegisterDisconnectCallback()
  | HAL_PCD_DataOutStageCallback()                   | HAL_PCD_RegisterDataOutStageCallback()
  | HAL_PCD_DataInStageCallback()                    | HAL_PCD_RegisterDataInStageCallback()
  | HAL_PCD_ISOOUTIncompleteCallback()               | HAL_PCD_RegisterIsoOutIncpltCallback()
  | HAL_PCD_ISOINIncompleteCallback()                | HAL_PCD_RegisterIsoInIncpltCallback()
  | HAL_PCD_ErrorCallback()                          | HAL_PCD_RegisterErrorCallback()
  | HAL_PCD_EndpointAbortTransferCallback()          | HAL_PCD_RegisterEndpointAbortTransferCallback()
  | HAL_PCD_BcdCallback()                            | HAL_PCD_RegisterBcdCallback()
  | HAL_PCD_LpmCallback()                            | HAL_PCD_RegisterLpmCallback()
  */

/**
  * @}
  */

/** @defgroup PCD_Configuration_Table Configuration Table
  * @{
  ## Configuration inside the USB PCD driver:

  | Config defines                 | Description     | Default value | Note
  |--------------------------------|-----------------|---------------|--------------------------------------------------
  | USE_ASSERT_DBG_PARAM           | from IDE        |       NA      | Enable the parameter assert.
  | USE_ASSERT_DBG_STATE           | from IDE        |       NA      | Enable the state assert.
  | USE_HAL_PCD_MODULE             | from hal_conf.h |        1      | Enable the HAL USB PCD module.
  | USE_HAL_PCD_REGISTER_CALLBACKS | from hal_conf.h |        0      | Enable the register callbacks.
  | USE_HAL_PCD_USB_EP_TYPE_ISOC   | from hal_conf.h |        1      | Enable support for isochronous endpoints.
  | USE_HAL_PCD_USB_BCD            | from hal_conf.h |        0      | Enable USB Battery Charging Detection support.
  | USE_HAL_PCD_USB_LPM            | from hal_conf.h |        0      | Enable USB Link Power Management support.
  | USE_HAL_PCD_USB_DOUBLE_BUFFER  | from hal_conf.h |        1      | Enable double-buffering for USB transfers.
  | USE_HAL_PCD_MAX_ENDPOINT_NB    | from hal_conf.h |        8      | Maximum number of USB PCD endpoints.
  | USE_HAL_PCD_USER_DATA          | from hal_conf.h |        0      | Add user data to the HAL USB PCD handle.
  | USE_HAL_PCD_GET_LAST_ERRORS    | from hal_conf.h |        0      | Add an error value to the HAL USB PCD handle.
  | USE_HAL_CHECK_PARAM            | from hal_conf.h |        0      | Enable checking of PCD API parameters at runtime.
  */

/**
  * @}
  */

