MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup PCD_Private_Macros Private Macros
  * @{
  */

/*! Macro to check ep_type */
#define HAL_PCD_CHECK_EP_TYPE(ep_type) ((((ep_type) == HAL_PCD_EP_TYPE_CTRL) \
                                         || ((ep_type) == HAL_PCD_EP_TYPE_BULK) \
                                         || ((ep_type) == HAL_PCD_EP_TYPE_INTR) \
                                         || ((ep_type) == HAL_PCD_EP_TYPE_ISOC)) ? 1U : 0U)

/**
  * @}
  */

/* Private functions prototypes ----------------------------------------------*/
/** @defgroup PCD_Private_Functions Private Functions
  * @{
  */

static hal_status_t PCD_DRD_EP_ISR_Handler(hal_pcd_handle_t *hpcd);
#if defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1)
static hal_status_t HAL_PCD_EP_DB_Transmit(hal_pcd_handle_t *hpcd, hal_pcd_ep_t *p_ep, uint16_t ep_value);
static uint16_t HAL_PCD_EP_DB_Receive(hal_pcd_handle_t *hpcd, hal_pcd_ep_t *p_ep, uint16_t ep_value);
#endif /* defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1) */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup PCD_Exported_Functions Exported Functions
  * @{
  */

/** @addtogroup PCD_Exported_Functions_Group1 Initialization and deinitialization functions
  *
  * @{
  This subsection provides a set of functions allowing to initialize and deinitialize the PCD.
  - Call the function HAL_PCD_Init() to initialize the selected PCD handle and associate an instance.
  - Call the function HAL_PCD_DeInit() to de-initialize the given HAL PCD instance by resetting the state machine.
  */

/**
  * @brief  Initializes the PCD according to the specified
  *         parameters in the hal_pcd_handle_t and initialize the associated instance.
  * @param  hpcd PCD handler
  * @param  instance PCD instance
  * @retval HAL status
  */
hal_status_t HAL_PCD_Init(hal_pcd_handle_t *hpcd, hal_pcd_t instance)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

  ASSERT_DBG_PARAM(IS_PCD_ALL_INSTANCE((usb_drd_global_t *)((uint32_t)instance)));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }

  if (!IS_PCD_ALL_INSTANCE((usb_drd_global_t *)((uint32_t)instance)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->instance = instance;

  switch (instance)
  {
    case HAL_PCD_DRD_FS:

      /* Register USB core instance operational functions */
      (void)USB_DRD_PCD_InitDriver(&hpcd->driver);

      hpcd->p_irq_handler = HAL_PCD_DRD_IRQHandler;

      /* Get the device endpoints number */
      hpcd->endpoints_nbr = (uint8_t)(USB_DRD_FS_EP_NBR);

      break;

    default:
      break;
  }

#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
  hpcd->last_error_codes = HAL_PCD_ERROR_NONE;
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
  hpcd->p_sof_cb = HAL_PCD_SofCallback;
  hpcd->p_setup_stage_cb = HAL_PCD_SetupStageCallback;
  hpcd->p_reset_cb = HAL_PCD_ResetCallback;
  hpcd->p_suspend_cb = HAL_PCD_SuspendCallback;
  hpcd->p_resume_cb = HAL_PCD_ResumeCallback;
  hpcd->p_connect_cb = HAL_PCD_ConnectCallback;
  hpcd->p_disconnect_cb = HAL_PCD_DisconnectCallback;
  hpcd->p_data_out_stage_cb = HAL_PCD_DataOutStageCallback;
  hpcd->p_data_in_stage_cb = HAL_PCD_DataInStageCallback;
  hpcd->p_iso_out_incomplete_cb = HAL_PCD_ISOOUTIncompleteCallback;
  hpcd->p_iso_in_incomplete_cb = HAL_PCD_ISOINIncompleteCallback;
  hpcd->p_error_cb = HAL_PCD_ErrorCallback;
  hpcd->p_ep_abort_transfer_cb = HAL_PCD_EndpointAbortTransferCallback;
  hpcd->p_low_power_management_cb = HAL_PCD_LpmCallback;
  hpcd->p_battery_charging_cb = HAL_PCD_BcdCallback;
#endif /* (USE_HAL_PCD_REGISTER_CALLBACKS) */

  /* Reset device address */
  hpcd->usb_address = 0U;

#if defined (USE_HAL_PCD_USER_DATA) && (USE_HAL_PCD_USER_DATA == 1U)
  hpcd->p_user_data = (void *) NULL;
#endif /* USE_HAL_PCD_USER_DATA */

  hpcd->device_state = HAL_PCD_PORT_STATE_DEV_DISCONNECT;
  hpcd->global_state = HAL_PCD_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  DeInitializes the PCD peripheral.
  * @param  hpcd PCD handler
  */
void HAL_PCD_DeInit(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

  ASSERT_DBG_PARAM(IS_PCD_ALL_INSTANCE((usb_drd_global_t *)((uint32_t)hpcd->instance)));

  /* Stop device operation before de-initializing */
  (void)hpcd->driver.device_stop((uint32_t)hpcd->instance);

#if defined (USE_HAL_PCD_USER_DATA) && (USE_HAL_PCD_USER_DATA == 1U)
  hpcd->p_user_data = (void *) NULL;
#endif /* USE_HAL_PCD_USER_DATA */

#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
  hpcd->last_error_codes = HAL_PCD_ERROR_NONE;
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */
  hpcd->device_state = HAL_PCD_PORT_STATE_DEV_DISCONNECT;
  hpcd->global_state = HAL_PCD_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup PCD_Exported_Functions_Group2 Global Configuration functions
  * @{
  This subsection provides functions allowing to configure the USB in Device mode:
  - Call HAL_PCD_SetConfig() to configure the initialized instance with a set of parameters containing:
     * phy_interface
     * endpoints_nbr
     * core_speed
     * bulk_db_state
     * iso_db_state
  */

/**
  * @brief  Configure the PCD according to the specified
  *         parameters in the hal_pcd_handle_t and initialize the associated handle.
  * @param  hpcd PCD handler
  * @param  p_config pointer to the peripheral configuration structure
  * @retval HAL status
  */
hal_status_t HAL_PCD_SetConfig(hal_pcd_handle_t *hpcd, const hal_pcd_config_t *p_config)
{
  hal_status_t ret = HAL_OK;
  uint8_t ep_idx;
  usb_core_config_params_t usb_core_config = {0U};

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_config != NULL));

