MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_config == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, HAL_PCD_STATE_INIT);

  switch (hpcd->instance)
  {
    case HAL_PCD_DRD_FS:

      usb_core_config.phy_interface = (usb_core_phy_module_t)p_config->phy_interface;
      usb_core_config.endpoints_nbr = hpcd->endpoints_nbr;
      usb_core_config.core_speed = (usb_core_speed_t)p_config->pcd_speed;
      usb_core_config.bcd_state = (usb_core_config_status_t)p_config->battery_charging_enable;

      break;

    default:
      break;
  }

  /* Prevent interrupts during USB device configuration */
  (void)hpcd->driver.core_disable_interrupts((uint32_t)hpcd->instance);

  /* Initialize the USB core */
  if (hpcd->driver.core_init((uint32_t)hpcd->instance, &usb_core_config) != USB_CORE_OK)
  {
    hpcd->global_state = HAL_PCD_STATE_FAULT;
    return HAL_ERROR;
  }

  /* Switch the USB core to device mode */
  if (hpcd->driver.core_set_mode((uint32_t)hpcd->instance, USB_CORE_DEVICE_MODE) != USB_CORE_OK)
  {
    hpcd->global_state = HAL_PCD_STATE_FAULT;
    ret = HAL_ERROR;
  }

  /* Init endpoints structures */
  for (ep_idx = 0U; ep_idx < USE_HAL_PCD_MAX_ENDPOINT_NB; ep_idx++)
  {
    /* Init ep structure */
    hpcd->in_ep[ep_idx].dir = HAL_PCD_EP_IN_DIR;
    hpcd->in_ep[ep_idx].num = (usb_core_endpoint_t)ep_idx;

    /* Control until ep is activated */
    hpcd->in_ep[ep_idx].type = USB_CORE_EP_TYPE_CTRL;
    hpcd->in_ep[ep_idx].max_packet = 0U;
    hpcd->in_ep[ep_idx].p_xfer_buffer = 0U;
    hpcd->in_ep[ep_idx].xfer_length = 0U;
  }

  for (ep_idx = 0U; ep_idx < USE_HAL_PCD_MAX_ENDPOINT_NB; ep_idx++)
  {
    hpcd->out_ep[ep_idx].dir = HAL_PCD_EP_OUT_DIR;
    hpcd->out_ep[ep_idx].num = (usb_core_endpoint_t)ep_idx;

    /* Control until ep is activated */
    hpcd->out_ep[ep_idx].type = USB_CORE_EP_TYPE_CTRL;
    hpcd->out_ep[ep_idx].max_packet = 0U;
    hpcd->out_ep[ep_idx].p_xfer_buffer = 0U;
    hpcd->out_ep[ep_idx].xfer_length = 0U;
  }

  /* Initialize device-specific registers and configuration */
  if (hpcd->driver.device_init((uint32_t)hpcd->instance, &usb_core_config) != USB_CORE_OK)
  {
    hpcd->global_state = HAL_PCD_STATE_FAULT;
    ret = HAL_ERROR;
  }

#if defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1)
  if (p_config->lpm_enable == HAL_PCD_LPM_ENABLED)
  {
    hpcd->driver.lpm_activate((uint32_t)hpcd->instance);
  }
#endif /* defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1) */

#if defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1)
  if (p_config->battery_charging_enable == HAL_PCD_BCD_ENABLED)
  {
    hpcd->driver.bcd_activate((uint32_t)hpcd->instance);
  }
#endif /* defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1) */

  hpcd->driver.device_disconnect((uint32_t)hpcd->instance);

  if (ret != HAL_ERROR)
  {
    hpcd->global_state = HAL_PCD_STATE_IDLE;
  }

  return ret;
}

/**
  * @}
  */

/** @addtogroup PCD_Exported_Functions_Group3 User Data functions
  * @{
 A set of functions allowing to manage a user data pointer stored to the PCD handle:
 - HAL_PCD_SetUserData() Set the user data into the handle
 - HAL_PCD_GetUserData() Get the user data from the handle
  */
#if defined (USE_HAL_PCD_USER_DATA) && (USE_HAL_PCD_USER_DATA == 1)
/**
  * @brief Set the user data pointer into the handle.
  * @param hpcd Pointer to a hal_pcd_handle_t
  * @param p_user_data Pointer to the user data.
  */
void HAL_PCD_SetUserData(hal_pcd_handle_t *hpcd, const void *p_user_data)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

  hpcd->p_user_data = p_user_data;
}

/**
  * @brief Get the user data pointer from the handle.
  * @param hpcd Pointer to a hal_pcd_handle_t
  * @retval Pointer to the user data.
  */
const void *HAL_PCD_GetUserData(const hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

  return (hpcd->p_user_data);
}
#endif /* USE_HAL_PCD_USER_DATA */

#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
/**
  * @brief Get Last Error codes.
  * @param hpcd Pointer to a hal_pcd_handle_t
  * @retval last error code.
  */
uint32_t HAL_PCD_GetLastErrorCodes(const hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

  return (hpcd->last_error_codes);
}
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */
/**
  * @}
  */

/** @addtogroup PCD_Exported_Functions_Group4 Peripheral Control functions
  * @{
  */
/**
  * @brief  Start the USB device.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_Start(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, HAL_PCD_STATE_IDLE);
  HAL_CHECK_UPDATE_STATE(hpcd, global_state, HAL_PCD_STATE_IDLE, HAL_PCD_STATE_ACTIVE);

  hpcd->driver.device_start((uint32_t)hpcd->instance);

  return HAL_OK;
}

/**
  * @brief  Stop the USB device.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_Stop(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  (void)hpcd->driver.core_disable_interrupts((uint32_t)hpcd->instance);
  (void)hpcd->driver.device_disconnect((uint32_t)hpcd->instance);
  (void)hpcd->driver.device_stop((uint32_t)hpcd->instance);

  hpcd->device_state = HAL_PCD_PORT_STATE_DEV_DISCONNECT;
  hpcd->global_state = HAL_PCD_STATE_IDLE;

  return HAL_OK;
}


#if defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1)
/**
  * @brief  Start LPM (low Power Management) feature.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_LPM_Start(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

