MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  hpcd->driver.lpm_activate((uint32_t)hpcd->instance);
  hpcd->lpm_active = HAL_PCD_LPM_ENABLED;
  hpcd->lpm_state = HAL_PCD_LPM_STATE_L0;

  return HAL_OK;
}

/**
  * @brief  Stop LPM (low Power Management) feature.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_LPM_Stop(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  hpcd->driver.lpm_deactivate((uint32_t)hpcd->instance);
  hpcd->lpm_active = HAL_PCD_LPM_DISABLED;

  return HAL_OK;
}
#endif /* defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1) */


#if defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1)

/**
  * @brief  Start Battery Charging feature.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_BCD_Start(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, HAL_PCD_STATE_IDLE);

  hpcd->driver.bcd_activate((uint32_t)hpcd->instance);
  hpcd->battery_charging_active = HAL_PCD_BCD_ENABLED;

  return HAL_OK;
}

/**
  * @brief  Stop Battery Charging feature.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_BCD_Stop(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, HAL_PCD_STATE_IDLE);

  hpcd->driver.bcd_deactivate((uint32_t)hpcd->instance);
  hpcd->battery_charging_active = HAL_PCD_BCD_DISABLED;

  return HAL_OK;
}

/**
  * @brief  Port Type Detection Process.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_BCD_PortTypeDetection(hal_pcd_handle_t *hpcd)
{
  uint32_t tickstart = HAL_GetTick();
  uint32_t wait_start;
  hal_pcd_bcd_port_status_t port_type;

  ASSERT_DBG_PARAM((hpcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, HAL_PCD_STATE_IDLE);

  /* Wait for Min DCD Timeout (T_DCD_TIMEOUT >= 300ms per USB BCD spec 1.2) */
  wait_start = HAL_GetTick();
  while ((HAL_GetTick() - wait_start) < 350U)
  {
    /* Busy-wait */
  }

  /* Start BCD Primary detection */
  hpcd->driver.bcd_set_mode((uint32_t)hpcd->instance, USB_CORE_BCD_CONFIG_DCD, USB_CORE_BCD_CONFIG_STS_CLEAR);

  /* Wait for T_VDP_SRC_ON >= 40ms */
  wait_start = HAL_GetTick();
  while ((HAL_GetTick() - wait_start) < 50U)
  {
    /* Busy-wait */
  }

  hpcd->driver.bcd_set_mode((uint32_t)hpcd->instance, USB_CORE_BCD_CONFIG_PD, USB_CORE_BCD_CONFIG_STS_SET);

  /* Wait for primary detection result to stabilize */
  wait_start = HAL_GetTick();
  while ((HAL_GetTick() - wait_start) < 50U)
  {
    /* Busy-wait */
  }

  /* Determine the detected BCD port type */
  port_type = (hal_pcd_bcd_port_status_t)hpcd->driver.bcd_detect_port_type((uint32_t)hpcd->instance,
                                                                           USB_CORE_BCD_PRIMARY_DETECTION);

  if (port_type == HAL_PCD_BCD_PORT_STATUS_STD_DOWNSTREAM)
  {
    /* Standard Downstream Port */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_battery_charging_cb(hpcd, HAL_PCD_BCD_STD_DOWNSTREAM_PORT);
#else
    HAL_PCD_BcdCallback(hpcd, HAL_PCD_BCD_STD_DOWNSTREAM_PORT);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
  }
  else
  {
    /* Start BCD Secondary detection */
    hpcd->driver.bcd_set_mode((uint32_t)hpcd->instance, USB_CORE_BCD_CONFIG_PD, USB_CORE_BCD_CONFIG_STS_CLEAR);

    /* Wait for T_VDM_SRC_ON >= 40ms */
    wait_start = HAL_GetTick();
    while ((HAL_GetTick() - wait_start) < 50U)
    {
      /* Busy-wait */
    }

    hpcd->driver.bcd_set_mode((uint32_t)hpcd->instance, USB_CORE_BCD_CONFIG_SD, USB_CORE_BCD_CONFIG_STS_SET);

    /* Wait for secondary detection result to stabilize */
    wait_start = HAL_GetTick();
    while ((HAL_GetTick() - wait_start) < 50U)
    {
      /* Busy-wait */
    }

    /* Determine the detected BCD port type */
    port_type = (hal_pcd_bcd_port_status_t)hpcd->driver.bcd_detect_port_type((uint32_t)hpcd->instance,
                                                                             USB_CORE_BCD_SECONDARY_DETECTION);


    if (port_type == HAL_PCD_BCD_PORT_STATUS_DEDICATED_CHARGING)
    {
      /* Case Dedicated Charging Port  */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_battery_charging_cb(hpcd, HAL_PCD_BCD_DEDICATED_CHARGING_PORT);
#else
      HAL_PCD_BcdCallback(hpcd, HAL_PCD_BCD_DEDICATED_CHARGING_PORT);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
    }
    else
    {
      /* Case Charging Downstream Port */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_battery_charging_cb(hpcd, HAL_PCD_BCD_CHARGING_DOWNSTREAM_PORT);
#else
      HAL_PCD_BcdCallback(hpcd, HAL_PCD_BCD_CHARGING_DOWNSTREAM_PORT);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
    }
  }

  /* Battery Charging capability discovery finished */
  hpcd->driver.bcd_deactivate((uint32_t)hpcd->instance);
  hpcd->battery_charging_active = HAL_PCD_BCD_DISABLED;

  /* Check for the Timeout, else start USB Device */
  if ((HAL_GetTick() - tickstart) > 1000U)
  {
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_battery_charging_cb(hpcd, HAL_PCD_BCD_ERROR);
#else
    HAL_PCD_BcdCallback(hpcd, HAL_PCD_BCD_ERROR);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
  }
  else
  {
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_battery_charging_cb(hpcd, HAL_PCD_BCD_DISCOVERY_COMPLETED);
#else
    HAL_PCD_BcdCallback(hpcd, HAL_PCD_BCD_DISCOVERY_COMPLETED);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}
#endif /* defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1) */


/**
  * @brief  Connect the USB device.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_DeviceConnect(const hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

