MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (ep_num >= ((uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB)))
  {
    return 0U;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, HAL_PCD_STATE_ACTIVE);

  return hpcd->out_ep[ep_num].xfer_count;
}

/**
  * @brief  Send an amount of data.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @param  p_buffer pointer to the transmission buffer
  * @param  size_byte amount of data to be sent
  * @retval HAL status
  */
hal_status_t HAL_PCD_SetEndpointTransmit(hal_pcd_handle_t *hpcd, uint8_t ep_addr, uint8_t *p_buffer, uint32_t size_byte)
{
  hal_pcd_ep_t *p_ep;
  uint8_t ep_num = ep_addr & HAL_PCD_EP_ADDR_MSK;

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((ep_num < (uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (ep_num >= ((uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB)))
  {
    return HAL_INVALID_PARAM;
  }

  if ((p_buffer == NULL) && (size_byte != 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  hpcd->in_ep[ep_num].dir = HAL_PCD_EP_IN_DIR;

  p_ep = &hpcd->in_ep[ep_num];

  /* Configure the endpoint buffer and initiate the transfer */
  p_ep->p_xfer_buffer = p_buffer;
  p_ep->xfer_length = size_byte;
  p_ep->xfer_size = size_byte;
  p_ep->xfer_count = 0U;
  p_ep->num = (usb_core_endpoint_t)ep_num;

  (void)hpcd->driver.ep_start_transfer((uint32_t)hpcd->instance, p_ep);

  return HAL_OK;
}

/**
  * @brief  Set a STALL condition over an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
hal_status_t HAL_PCD_SetEndpointStall(hal_pcd_handle_t *hpcd, uint8_t ep_addr)
{
  hal_pcd_ep_t *p_ep;
  uint8_t ep_num = ep_addr & HAL_PCD_EP_ADDR_MSK;

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((ep_num < (uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (ep_num >= ((uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  if ((ep_addr & USB_CORE_IN_EP_DIR_MSK) == USB_CORE_IN_EP_DIR_MSK)
  {
    hpcd->in_ep[ep_num].dir = HAL_PCD_EP_IN_DIR;
    p_ep = &hpcd->in_ep[ep_num];
  }
  else
  {
    hpcd->out_ep[ep_num].dir = HAL_PCD_EP_OUT_DIR;
    p_ep = &hpcd->out_ep[ep_num];
  }

  p_ep->num = (usb_core_endpoint_t)ep_num;

  (void)hpcd->driver.ep_set_stall((uint32_t)hpcd->instance, p_ep);

  return HAL_OK;
}

/**
  * @brief  Clear a STALL condition over an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
hal_status_t HAL_PCD_ClearEndpointStall(hal_pcd_handle_t *hpcd, uint8_t ep_addr)
{
  hal_pcd_ep_t *p_ep;
  uint8_t ep_num = ep_addr & HAL_PCD_EP_ADDR_MSK;

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((ep_num < (uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (ep_num >= ((uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  if ((ep_addr & USB_CORE_IN_EP_DIR_MSK) == USB_CORE_IN_EP_DIR_MSK)
  {
    hpcd->in_ep[ep_num].dir = HAL_PCD_EP_IN_DIR;
    p_ep = &hpcd->in_ep[ep_num];
  }
  else
  {
    hpcd->out_ep[ep_num].dir = HAL_PCD_EP_OUT_DIR;
    p_ep = &hpcd->out_ep[ep_num];
  }

  p_ep->num = (usb_core_endpoint_t)ep_num;

  (void)hpcd->driver.ep_clear_stall((uint32_t)hpcd->instance, p_ep);

  return HAL_OK;
}

/**
   * @brief  Abort an USB endpoint transaction.
   * @param  hpcd PCD handle
   * @param  ep_addr endpoint address
   * @retval HAL status
   */
hal_status_t HAL_PCD_AbortEndpointTransfer(hal_pcd_handle_t *hpcd, uint8_t ep_addr)
{
  const hal_pcd_ep_t *p_ep;
  uint8_t ep_num = ep_addr & HAL_PCD_EP_ADDR_MSK;

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((ep_num < (uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (ep_num >= ((uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  if ((ep_addr & USB_CORE_IN_EP_DIR_MSK) == USB_CORE_IN_EP_DIR_MSK)
  {
    p_ep = &hpcd->in_ep[ep_num];
  }
  else
  {
    p_ep = &hpcd->out_ep[ep_num];
  }

  /* Abort any ongoing transfer on this endpoint */
  if (hpcd->driver.ep_stop_transfer((uint32_t)hpcd->instance, p_ep) != USB_CORE_OK)
  {
    return HAL_ERROR;
  }

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
  hpcd->p_ep_abort_transfer_cb(hpcd, ep_num);
#else
  HAL_PCD_EndpointAbortTransferCallback(hpcd, ep_num);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

  return HAL_OK;
}

/**
  * @brief  Flush an endpoint.
  * @param  hpcd PCD handle
  * @param  ep_addr endpoint address
  * @retval HAL status
  */
hal_status_t HAL_PCD_FlushEndpoint(const hal_pcd_handle_t *hpcd, uint8_t ep_addr)
{
  STM32_UNUSED(hpcd);
  STM32_UNUSED(ep_addr);

  return HAL_OK;
}

/**
  * @brief  Start remote wakeup signalling.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_RemoteWakeup_Start(const hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM(hpcd != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  (void)hpcd->driver.remote_wakeup_activate((uint32_t)hpcd->instance);

  return HAL_OK;
}

/**
  * @brief  Stop remote wakeup signalling.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
hal_status_t HAL_PCD_RemoteWakeup_Stop(const hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM(hpcd != NULL);

