MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  (void)hpcd->driver.remote_wakeup_deactivate((uint32_t)hpcd->instance);

  return HAL_OK;
}


/**
  * @brief  Configure PMA for endpoints.
  * @param  hpcd  Device instance
  * @param  ep_addr endpoint address
  * @param  ep_kind endpoint Kind
  *                  HAL_PCD_SNG_BUF: Single Buffer used
  *                  HAL_PCD_DBL_BUF: Double Buffer used
  * @param  pma_address: endpoint buffer address in The PMA: In case of single buffer endpoint
  *                   this parameter is 16-bit value providing the address of endpoint buffer in PMA.
  *                   In case of double buffer endpoint this parameter
  *                   is a 32-bit value providing the endpoint buffer 0 address
  *                   in the LSB part of 32-bit value and endpoint buffer 1 address
  *                   in the MSB part of 32-bit value.
  * @retval HAL status
  */
hal_status_t HAL_PCD_PMAConfig(hal_pcd_handle_t *hpcd, uint16_t ep_addr, uint16_t ep_kind, uint32_t pma_address)
{
  hal_pcd_ep_t *p_ep;
  uint16_t ep_num = ep_addr & HAL_PCD_EP_ADDR_MSK;

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((ep_num < (uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (ep_num >= ((uint8_t)USE_HAL_PCD_MAX_ENDPOINT_NB)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(hpcd->global_state, ((uint32_t)HAL_PCD_STATE_IDLE)
                   | ((uint32_t)HAL_PCD_STATE_ACTIVE));

  /* Initialize ep structure */
  if ((ep_addr & USB_CORE_IN_EP_DIR_MSK) == USB_CORE_IN_EP_DIR_MSK)
  {
    hpcd->in_ep[ep_num].dir = HAL_PCD_EP_IN_DIR;
    p_ep = &hpcd->in_ep[ep_num];
  }
  else
  {
    hpcd->out_ep[ep_num].dir = HAL_PCD_EP_OUT_DIR;
    p_ep = &hpcd->out_ep[ep_num];
  }

  /* Here we check if the endpoint is single or double Buffer */
  if (ep_kind == (uint16_t)HAL_PCD_SNG_BUF)
  {
    /* Disable endpoint Double Buffer mode */
    p_ep->double_buffer_en = 0U;

    /* Configure the PMA buffer address */
    p_ep->pma_address = (uint16_t)pma_address;
  }
#if defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1)
  else /* HAL_PCD_DBL_BUF */
  {
    /* Enable endpoint Double Buffer mode */
    p_ep->double_buffer_en = 1U;

    /* Configure the PMA double buffer address */
    p_ep->pma_addr0 = (uint16_t)(pma_address & 0xFFFFU);
    p_ep->pma_addr1 = (uint16_t)((pma_address & 0xFFFF0000U) >> 16);
  }
#endif /* defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1) */

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup PCD_Exported_Functions_Group5 Peripheral State functions
  * @{
  */

/**
  * @brief  Return the PCD handle state.
  * @param  hpcd PCD handle
  * @retval HAL state
  */
hal_pcd_state_t HAL_PCD_GetState(const hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));

  return hpcd->global_state;
}

/**
  * @}
  */

/** @addtogroup PCD_Exported_Functions_Group6 IRQ handling functions
  * @{
  */
/**
  * @brief  Dispatch the PCD interrupt request.
  * @param  hpcd PCD handle
  */
void HAL_PCD_IRQHandler(hal_pcd_handle_t *hpcd)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((hpcd->p_irq_handler != NULL));

  hpcd->current_mode = hpcd->driver.core_get_mode((uint32_t)hpcd->instance);

  hpcd->p_irq_handler(hpcd);
}


/**
  * @brief  Handle the USB DRD FS interrupt request.
  * @param  hpcd PCD handle
  */
void HAL_PCD_DRD_IRQHandler(hal_pcd_handle_t *hpcd)
{
  hal_status_t ep_istr_status;
  usb_drd_global_t *p_usb;
  uint32_t istr_reg;


  ASSERT_DBG_PARAM((hpcd != NULL));

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hpcd->instance);
  istr_reg = USB_DRD_ReadInterrupts((uint32_t)p_usb);

  if ((istr_reg & USB_ISTR_CTR) == USB_ISTR_CTR)
  {
    /* Servicing of the endpoint correct transfer interrupt */
    /* clear of the CTR flag into the endpoint routine */
    ep_istr_status = PCD_DRD_EP_ISR_Handler(hpcd);

    if (ep_istr_status != HAL_OK)
    {
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_error_cb(hpcd);
#else
      HAL_PCD_ErrorCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
    }

    return;
  }

  if ((istr_reg & USB_ISTR_RESET) == USB_ISTR_RESET)
  {
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_RESET);

    /* Ensure EP0 is disabled */
    USB_DRD_PCD_SET_EP_TX_STATUS((uint32_t)p_usb, USB_CORE_PHY_CHEP_0, USB_EP_TX_DIS);
    USB_DRD_PCD_SET_EP_RX_STATUS((uint32_t)p_usb, USB_CORE_PHY_CHEP_0, USB_EP_RX_DIS);

    hpcd->device_state = HAL_PCD_PORT_STATE_DEV_RESET;

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_reset_cb(hpcd);
#else
    HAL_PCD_ResetCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

    hpcd->usb_address = 0U;
    (void)hpcd->driver.device_set_address((uint32_t)p_usb, hpcd->usb_address);

    return;
  }

  if ((istr_reg & USB_ISTR_PMAOVR) == USB_ISTR_PMAOVR)
  {
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_PMAOVR);

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_error_cb(hpcd);
#else
    HAL_PCD_ErrorCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

    return;
  }

  if ((istr_reg & USB_ISTR_ERR) == USB_ISTR_ERR)
  {
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_ERR);

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_error_cb(hpcd);
#else
    HAL_PCD_ErrorCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

    return;
  }

  if ((istr_reg & USB_ISTR_WKUP) == USB_ISTR_WKUP)
  {
    p_usb->CNTR &= ~(USB_CNTR_SUSPRDY);
    p_usb->CNTR &= ~(USB_CNTR_SUSPEN);

    hpcd->device_state = HAL_PCD_PORT_STATE_DEV_RUN;

#if defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1)
    if (hpcd->lpm_state == HAL_PCD_LPM_STATE_L1)
    {
      hpcd->lpm_state = HAL_PCD_LPM_STATE_L0;
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_low_power_management_cb(hpcd, HAL_PCD_LPM_L0_ACTIVE);
#else
      HAL_PCD_LpmCallback(hpcd, HAL_PCD_LPM_L0_ACTIVE);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
    }
#endif /* defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1) */

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_resume_cb(hpcd);
#else
    HAL_PCD_ResumeCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_WKUP);

    return;
  }

  if ((istr_reg & USB_ISTR_SUSP) == USB_ISTR_SUSP)
  {
    /* Force low-power mode in the macrocell */
    p_usb->CNTR |= USB_CNTR_SUSPEN;

    /* Clear of the ISTR bit is done after setting CNTR_FSUSP */
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_SUSP);

    p_usb->CNTR |= USB_CNTR_SUSPRDY;

    hpcd->device_state = HAL_PCD_PORT_STATE_DEV_SUSPEND;

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_suspend_cb(hpcd);
#else
    HAL_PCD_SuspendCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

    return;
  }

#if defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1)
  /* Handle LPM (low Power Management) Interrupt */
  if ((istr_reg & USB_ISTR_L1REQ) == USB_ISTR_L1REQ)
  {
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_L1REQ);
    if (hpcd->lpm_state == HAL_PCD_LPM_STATE_L0)
    {
      /* Force suspend and low-power mode before going to L1 state*/
      p_usb->CNTR |= USB_CNTR_SUSPRDY;
      p_usb->CNTR |= USB_CNTR_SUSPEN;

      hpcd->lpm_state = HAL_PCD_LPM_STATE_L1;
      hpcd->lpm_besl = ((uint32_t)p_usb->LPMCSR & USB_LPMCSR_BESL) >> 2;
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_low_power_management_cb(hpcd, HAL_PCD_LPM_L1_ACTIVE);
#else
      HAL_PCD_LpmCallback(hpcd, HAL_PCD_LPM_L1_ACTIVE);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
    }
    else
    {
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_suspend_cb(hpcd);
#else
      HAL_PCD_SuspendCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
    }

    return;
  }
#endif /* defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1) */

  if ((istr_reg & USB_ISTR_SOF) == USB_ISTR_SOF)
  {
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_SOF);

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
    hpcd->p_sof_cb(hpcd);
#else
    HAL_PCD_SofCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

    return;
  }

