MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
  if ((istr_reg & USB_ISTR_ESOF) == USB_ISTR_ESOF)
  {
    /* Clear ESOF flag in ISTR */
    USB_DRD_ClearInterrupts((uint32_t)p_usb, USB_ISTR_ESOF);

    return;
  }
}


/**
  * @}
  */

/** @addtogroup PCD_Exported_Functions_Group7 Default Callbacks functions
  * @{
  */
/**
  * @brief  Send LPM (low Power Management) active status to user layer callback.
  * @param  hpcd PCD handle
  * @param  lpm_status LPM active status
  */
__WEAK void HAL_PCD_LpmCallback(hal_pcd_handle_t *hpcd, hal_pcd_lpm_active_status_t lpm_status)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);
  STM32_UNUSED(lpm_status);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_LpmCallback could be implemented in the user file
   */
}

/**
  * @brief  Send BatteryCharging port type to user layer callback.
  * @param  hpcd PCD handle
  * @param  port_type port type
  */
__WEAK void HAL_PCD_BcdCallback(hal_pcd_handle_t *hpcd, hal_pcd_bcd_port_type_t port_type)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);
  STM32_UNUSED(port_type);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_BcdCallback could be implemented in the user file
   */
}

/**
  * @brief  Data OUT stage callback.
  * @param  hpcd PCD handle
  * @param  ep_num endpoint number
  */
__WEAK void HAL_PCD_DataOutStageCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);
  STM32_UNUSED(ep_num);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_DataOutStageCallback could be implemented in the user file
   */
}

/**
  * @brief  Data IN stage callback.
  * @param  hpcd PCD handle
  * @param  ep_num endpoint number
  */
__WEAK void HAL_PCD_DataInStageCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);
  STM32_UNUSED(ep_num);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_DataInStageCallback could be implemented in the user file
   */
}
/**
  * @brief  Setup stage callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_SetupStageCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_SetupStageCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Start Of Frame callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_SofCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_SofCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Reset callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_ResetCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_ResetCallback could be implemented in the user file
   */
}

/**
  * @brief  Suspend event callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_SuspendCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_SuspendCallback could be implemented in the user file
   */
}

/**
  * @brief  Resume event callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_ResumeCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_ResumeCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO OUT callback.
  * @param  hpcd PCD handle
  * @param  ep_num endpoint number
  */
__WEAK void HAL_PCD_ISOOUTIncompleteCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);
  STM32_UNUSED(ep_num);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_ISOOUTIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO IN callback.
  * @param  hpcd PCD handle
  * @param  ep_num endpoint number
  */
__WEAK void HAL_PCD_ISOINIncompleteCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);
  STM32_UNUSED(ep_num);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_ISOINIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Connection event callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_ConnectCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_ConnectCallback could be implemented in the user file
   */
}

/**
  * @brief  Disconnection event callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_DisconnectCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_DisconnectCallback could be implemented in the user file
   */
}

/**
  * @brief  PCD Error callback.
  * @param  hpcd PCD handle
  */
__WEAK void HAL_PCD_ErrorCallback(hal_pcd_handle_t *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_ErrorCallback could be implemented in the user file
   */
}

/**
  * @brief  PCD Endpoint Abort Transfer callback.
  * @param  hpcd PCD handle
  * @param  ep_num endpoint number
  */
__WEAK void HAL_PCD_EndpointAbortTransferCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpcd);
  STM32_UNUSED(ep_num);

  /* WARNING : This function must not be modified, when the callback is needed,
            the HAL_PCD_EndpointAbortTransferCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/** @addtogroup PCD_Exported_Functions_Group8 Register Callbacks functions
  * @{
  */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register USB PCD SOF callback
  *         To be used instead of the weak predefined callback.
  * @param  hpcd USB PCD handle
  * @param  p_callback pointer to the SOF callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterSofCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

