MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_sof_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB PCD Setup callback
  *         To be used instead of the weak predefined callback.
  * @param  hpcd USB PCD handle
  * @param  p_callback pointer to the Setup callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterSetupCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_setup_stage_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB PCD Reset callback
  *         To be used instead of the weak predefined callback.
  * @param  hpcd USB PCD handle
  * @param  p_callback pointer to the Reset callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterResetCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_reset_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB PCD Suspend callback
  *         To be used instead of the weak predefined callback.
  * @param  hpcd USB PCD handle
  * @param  p_callback pointer to the Suspend callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterSuspendCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_suspend_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB PCD Resume callback
  *         To be used instead of the weak predefined callback.
  * @param  hpcd USB PCD handle
  * @param  p_callback pointer to the Resume callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterResumeCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_resume_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB PCD Connect callback
  *         To be used instead of the weak predefined callback.
  * @param  hpcd USB PCD handle
  * @param  p_callback pointer to the Connect callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterConnectCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_connect_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a USB PCD Disconnect callback
  *         To be used instead of the weak predefined callback.
  * @param  hpcd USB PCD handle
  * @param  p_callback pointer to the Disconnect callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterDisconnectCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_disconnect_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD Data OUT Stage callback
  *         To be used instead of the weak HAL_PCD_DataOutStageCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD Data OUT Stage callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterDataOutStageCallback(hal_pcd_handle_t *hpcd, hal_pcd_data_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_data_out_stage_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD Data IN Stage callback
  *         To be used instead of the weak HAL_PCD_DataInStageCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD Data IN Stage callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterDataInStageCallback(hal_pcd_handle_t *hpcd, hal_pcd_data_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_data_in_stage_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD Iso OUT incomplete callback
  *         To be used instead of the weak HAL_PCD_ISOOUTIncompleteCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD Iso OUT incomplete callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterIsoOutIncpltCallback(hal_pcd_handle_t *hpcd, hal_pcd_iso_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

