MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_iso_out_incomplete_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD Iso IN incomplete callback
  *         To be used instead of the weak HAL_PCD_ISOINIncompleteCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD Iso IN incomplete callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterIsoInIncpltCallback(hal_pcd_handle_t *hpcd, hal_pcd_iso_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_iso_in_incomplete_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD Error callback
  *         To be used instead of the weak HAL_PCD_ErrorCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD Error callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterErrorCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD Endpoint Abort Transfer callback
  *         To be used instead of the weak HAL_PCD_EndpointAbortTransferCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD Endpoint Abort Transfer callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterEndpointAbortTransferCallback(hal_pcd_handle_t *hpcd, hal_pcd_data_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_ep_abort_transfer_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD BCD callback
  *         To be used instead of the weak HAL_PCD_BcdCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD BCD callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterBcdCallback(hal_pcd_handle_t *hpcd, hal_pcd_bcd_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_battery_charging_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register USB PCD LPM callback
  *         To be used instead of the weak HAL_PCD_LpmCallback() predefined callback.
  * @param  hpcd PCD handle
  * @param  p_callback pointer to the USB PCD LPM callback function
  * @retval HAL status
  */
hal_status_t HAL_PCD_RegisterLpmCallback(hal_pcd_handle_t *hpcd, hal_pcd_lpm_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_callback == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hpcd->p_low_power_management_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @addtogroup PCD_Private_Functions
  * @{
  */


/**
  * @brief  This function handles PCD Endpoint interrupt request.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
static hal_status_t PCD_DRD_EP_ISR_Handler(hal_pcd_handle_t *hpcd)
{
  usb_drd_global_t *p_usb;
  hal_pcd_ep_t *p_ep;
  uint32_t ctr_count = 0U;
  uint16_t rx_count;
  uint16_t istr_reg;
  uint16_t ep_value;
  uint16_t tx_packet_size;
  uint8_t ep_idx;
  usb_core_phy_ep_t phy_ep_num;

  ASSERT_DBG_PARAM((hpcd != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (hpcd == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

#if defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 0U)
  rx_count = 0U;
#endif /* defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 0U) */

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hpcd->instance);

  /* Stay in loop while pending interrupts */
  while (((p_usb->ISTR & USB_ISTR_CTR) != 0U) && (ctr_count < USB_DRD_MAX_CTR_ITERATIONS))
  {
    hpcd->device_state = HAL_PCD_PORT_STATE_DEV_RUN;

    istr_reg = (uint16_t)p_usb->ISTR;

    /* extract highest priority endpoint number */
    ep_idx = (uint8_t)(istr_reg & USB_ISTR_IDN);

    if (ep_idx >= USE_HAL_PCD_MAX_ENDPOINT_NB)
    {
      (void)hpcd->driver.core_disable_interrupts((uint32_t)p_usb);

#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
      hpcd->last_error_codes |= HAL_PCD_ERROR_EP_INDEX;
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */

      return HAL_ERROR;
    }

    if (ep_idx == 0U)
    {
      /* Decode and service control endpoint interrupt */

      /* DIR bit = origin of the interrupt */
      if ((istr_reg & USB_ISTR_DIR) == 0U)
      {
        /* DIR = 0 */

        /* DIR = 0 => IN  int */
        /* DIR = 0 implies that (EP_CTR_TX = 1) always */
        USB_DRD_PCD_CLEAR_TX_EP_CTR((uint32_t)p_usb, USB_CORE_PHY_CHEP_0);
        p_ep = &hpcd->in_ep[0];

        /* Get Endpoint Physical number */
        phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

        p_ep->xfer_count = USB_DRD_PCD_GET_EP_TX_CNT((uint32_t)p_usb, phy_ep_num);
        p_ep->p_xfer_buffer += p_ep->xfer_count;

        /* TX COMPLETE */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
        hpcd->p_data_in_stage_cb(hpcd, 0U);
#else
        HAL_PCD_DataInStageCallback(hpcd, 0U);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

        if ((hpcd->usb_address > 0U) && (p_ep->xfer_length == 0U))
        {
          p_usb->DADDR = ((uint16_t)hpcd->usb_address | USB_DADDR_EF);
          hpcd->usb_address = 0U;
        }
      }
      else
      {
        /* DIR = 1 */

        /* DIR = 1 & CTR_RX => SETUP or OUT int */
        /* DIR = 1 & (CTR_TX | CTR_RX) => 2 int pending */
        p_ep = &hpcd->out_ep[0];

        /* Get Endpoint Physical number */
        phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

        ep_value = (uint16_t)USB_DRD_PCD_GET_ENDPOINT((uint32_t)p_usb, USB_CORE_PHY_CHEP_0);

        if ((ep_value & USB_EP_SETUP) != 0U)
        {
          /* Get SETUP Packet */
          p_ep->xfer_count = USB_DRD_PCD_GET_EP_RX_CNT((uint32_t)p_usb, phy_ep_num);

          if (p_ep->xfer_count != 8U)
          {
            /* Set Stall condition for EP0 IN/OUT */
            USB_DRD_PCD_SET_EP_RX_STATUS((uint32_t)p_usb, USB_CORE_PHY_CHEP_0, USB_EP_RX_STALL);
            USB_DRD_PCD_SET_EP_TX_STATUS((uint32_t)p_usb, USB_CORE_PHY_CHEP_0, USB_EP_TX_STALL);

            /* SETUP bit kept frozen while CTR_RX = 1 */
            USB_DRD_PCD_CLEAR_RX_EP_CTR((uint32_t)p_usb, USB_CORE_PHY_CHEP_0);

            return HAL_OK;
          }

          USB_DRD_ReadPMA((uint32_t)p_usb, (uint8_t *)hpcd->setup,
                          p_ep->pma_address, (uint16_t)p_ep->xfer_count);

          /* SETUP bit kept frozen while CTR_RX = 1 */
          USB_DRD_PCD_CLEAR_RX_EP_CTR((uint32_t)p_usb, USB_CORE_PHY_CHEP_0);

          /* Process SETUP Packet */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
          hpcd->p_setup_stage_cb(hpcd);
#else
          HAL_PCD_SetupStageCallback(hpcd);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
        }
        else if ((ep_value & USB_EP_VTRX) != 0U)
        {
          USB_DRD_PCD_CLEAR_RX_EP_CTR((uint32_t)p_usb, USB_CORE_PHY_CHEP_0);

