MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
          /* Get Control Data OUT Packet */
          p_ep->xfer_count = USB_DRD_PCD_GET_EP_RX_CNT((uint32_t)p_usb, phy_ep_num);

          if (p_ep->xfer_count == 0U)
          {
            /* Status phase re-arm for next setup */
            USB_DRD_PCD_SET_EP_RX_STATUS((uint32_t)p_usb, USB_CORE_PHY_CHEP_0, USB_EP_RX_VALID);
          }
          else
          {
            if (p_ep->p_xfer_buffer != NULL)
            {
              USB_DRD_ReadPMA((uint32_t)p_usb, p_ep->p_xfer_buffer,
                              p_ep->pma_address, (uint16_t)p_ep->xfer_count);

              p_ep->p_xfer_buffer += p_ep->xfer_count;

              /* Process Control Data OUT Packet */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
              hpcd->p_data_out_stage_cb(hpcd, 0U);
#else
              HAL_PCD_DataOutStageCallback(hpcd, 0U);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
            }
            else
            {
              USB_DRD_PCD_SET_EP_RX_STATUS((uint32_t)p_usb, USB_CORE_PHY_CHEP_0, USB_EP_RX_STALL);

#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
              hpcd->last_error_codes |= HAL_PCD_ERROR_OUT_EP_PACKET;
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */

              return HAL_ERROR;
            }
          }
        }
        else
        {
          /* .. */
        }
      }
    }
    else
    {
      /* Decode and service non control endpoints interrupt */
      /* Process related endpoint register */
      ep_value = (uint16_t)USB_DRD_PCD_GET_ENDPOINT((uint32_t)p_usb, (usb_core_phy_chep_t)ep_idx);

      if ((ep_value & USB_EP_VTRX) != 0U)
      {
        /* Clear int flag */
        USB_DRD_PCD_CLEAR_RX_EP_CTR((uint32_t)p_usb, (usb_core_phy_chep_t)ep_idx);
        p_ep = &hpcd->out_ep[ep_idx];

        /* Get Endpoint Physical number */
        phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

        /* OUT Single Buffering */
        if (p_ep->double_buffer_en == 0U)
        {
          rx_count = (uint16_t)USB_DRD_PCD_GET_EP_RX_CNT((uint32_t)p_usb, phy_ep_num);

          if (rx_count != 0U)
          {
            USB_DRD_ReadPMA((uint32_t)p_usb, p_ep->p_xfer_buffer, p_ep->pma_address, rx_count);
          }
        }
#if defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1)
        else
        {
          /* Manage double buffer bulk out */
          if (p_ep->type == USB_CORE_EP_TYPE_BULK)
          {
            rx_count = HAL_PCD_EP_DB_Receive(hpcd, p_ep, ep_value);
          }
#if defined (USE_HAL_PCD_USB_EP_TYPE_ISOC) && (USE_HAL_PCD_USB_EP_TYPE_ISOC == 1)
          else /* Manage double buffer iso out */
          {
            /* OUT double buffered endpoint */
            USB_DRD_TX_DTOG((uint32_t)p_usb, phy_ep_num);

            if ((USB_DRD_PCD_GET_ENDPOINT((uint32_t)p_usb, phy_ep_num) & USB_EP_DTOGRX) != 0U)
            {
              /* Read from endpoint BUF0Addr buffer */
              rx_count = (uint16_t)USB_DRD_PCD_GET_EP_DBUF0_CNT((uint32_t)p_usb, phy_ep_num);

              if (rx_count != 0U)
              {
                USB_DRD_ReadPMA((uint32_t)p_usb, p_ep->p_xfer_buffer, p_ep->pma_addr0, rx_count);
              }
            }
            else
            {
              /* Read from endpoint BUF1Addr buffer */
              rx_count = (uint16_t)USB_DRD_PCD_GET_EP_DBUF1_CNT((uint32_t)p_usb, phy_ep_num);

              if (rx_count != 0U)
              {
                USB_DRD_ReadPMA((uint32_t)p_usb, p_ep->p_xfer_buffer, p_ep->pma_addr1, rx_count);
              }
            }
          }
#endif /* defined (USE_HAL_PCD_USB_EP_TYPE_ISOC) && (USE_HAL_PCD_USB_EP_TYPE_ISOC == 1) */
        }
#endif /* defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1) */

        /* Multi-packet on the NON control OUT endpoint */
        p_ep->xfer_count += rx_count;

        if ((p_ep->xfer_length == 0U) || (rx_count < p_ep->max_packet))
        {
          /* RX COMPLETE */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
          hpcd->p_data_out_stage_cb(hpcd, p_ep->num);
#else
          HAL_PCD_DataOutStageCallback(hpcd, p_ep->num);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
        }
        else
        {
          p_ep->p_xfer_buffer += rx_count;
          (void)USB_DRD_StartEndpointXfer((uint32_t)p_usb, p_ep);
        }
      }

      if ((ep_value & USB_EP_VTTX) != 0U)
      {
        p_ep = &hpcd->in_ep[ep_idx];

        /* Get Endpoint Physical number */
        phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

        /* Clear int flag */
        USB_DRD_PCD_CLEAR_TX_EP_CTR((uint32_t)p_usb, phy_ep_num);

#if defined (USE_HAL_PCD_USB_EP_TYPE_ISOC) && (USE_HAL_PCD_USB_EP_TYPE_ISOC == 1)
        if (p_ep->type == USB_CORE_EP_TYPE_ISOC)
        {
          p_ep->xfer_length = 0U;

#if defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1)
          if (p_ep->double_buffer_en != 0U)
          {
            if ((ep_value & USB_EP_DTOGTX) != 0U)
            {
              USB_DRD_PCD_SET_EP_DBUF0_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, 0U);
            }
            else
            {
              USB_DRD_PCD_SET_EP_DBUF1_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, 0U);
            }
          }
#endif /* defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1) */

          /* TX COMPLETE */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
          hpcd->p_data_in_stage_cb(hpcd, p_ep->num);
#else
          HAL_PCD_DataInStageCallback(hpcd, p_ep->num);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
        }
        else
#endif /* defined (USE_HAL_PCD_USB_EP_TYPE_ISOC) && (USE_HAL_PCD_USB_EP_TYPE_ISOC == 1) */
        {
          /* Manage Single Buffer Transaction */
          if ((ep_value & USB_EP_EPKIND) == 0U)
          {
            /* Multi-packet on the NON control IN endpoint */
            tx_packet_size = (uint16_t)USB_DRD_PCD_GET_EP_TX_CNT((uint32_t)p_usb, phy_ep_num);

            if (p_ep->xfer_length > tx_packet_size)
            {
              p_ep->xfer_length -= tx_packet_size;
            }
            else
            {
              p_ep->xfer_length = 0U;
            }

            /* Zero Length Packet? */
            if (p_ep->xfer_length == 0U)
            {
              /* TX COMPLETE */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
              hpcd->p_data_in_stage_cb(hpcd, p_ep->num);
#else
              HAL_PCD_DataInStageCallback(hpcd, p_ep->num);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
            }
            else
            {
              /* Transfer is not yet Done */
              p_ep->p_xfer_buffer += tx_packet_size;
              p_ep->xfer_count += tx_packet_size;
              (void)USB_DRD_StartEndpointXfer((uint32_t)p_usb, p_ep);
            }
          }
#if defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1)
          /* Double Buffer bulk IN (bulk transfer Len > Ep_Mps) */
          else
          {
            (void)HAL_PCD_EP_DB_Transmit(hpcd, p_ep, ep_value);
          }
#endif /* defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1) */
        }
      }
    }

    ctr_count++;
  }

