MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.c
#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
  /* If still pending CTR, report error */
  if ((p_usb->ISTR & USB_ISTR_CTR) != 0U)
  {
    hpcd->last_error_codes |= HAL_PCD_ERROR_CTR_STUCK;
  }
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */

  return HAL_OK;
}


#if defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1)
/**
  * @brief  Manage double buffer bulk out transaction from ISR.
  * @param  hpcd PCD handle
  * @param  p_ep current endpoint handle
  * @param  ep_value Last snapshot of EPRx register value taken in ISR
  * @retval HAL status
  */
static uint16_t HAL_PCD_EP_DB_Receive(hal_pcd_handle_t *hpcd, hal_pcd_ep_t *p_ep, uint16_t ep_value)
{
  const usb_drd_global_t *p_usb;
  uint16_t rx_count;
  usb_core_phy_ep_t phy_ep_num;

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_ep != NULL));

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hpcd->instance);

  /* Manage Buffer0 OUT */
  if ((ep_value & USB_EP_DTOGRX) != 0U)
  {
    /* Get count of received Data on buffer0 */
    rx_count = (uint16_t)USB_DRD_PCD_GET_EP_DBUF0_CNT((uint32_t)p_usb, phy_ep_num);

    if (p_ep->xfer_length >= rx_count)
    {
      p_ep->xfer_length -= rx_count;
    }
    else
    {
      p_ep->xfer_length = 0U;
    }

    if (p_ep->xfer_length == 0U)
    {
      /* Set NAK to OUT endpoint since double buffer is enabled */
      USB_DRD_PCD_SET_EP_RX_STATUS((uint32_t)p_usb, phy_ep_num, USB_EP_RX_NAK);
    }

    /* Check if Buffer1 is in blocked state which requires to toggle */
    if ((ep_value & USB_EP_DTOGTX) != 0U)
    {
      /* OUT double buffered endpoint */
      USB_DRD_TX_DTOG((uint32_t)p_usb, phy_ep_num);
    }

    if (rx_count != 0U)
    {
      USB_DRD_ReadPMA((uint32_t)p_usb, p_ep->p_xfer_buffer, p_ep->pma_addr0, rx_count);
    }
  }
  /* Manage Buffer 1 DTOG_RX=0 */
  else
  {
    /* Get count of received data */
    rx_count = (uint16_t)USB_DRD_PCD_GET_EP_DBUF1_CNT((uint32_t)p_usb, phy_ep_num);

    if (p_ep->xfer_length >= rx_count)
    {
      p_ep->xfer_length -= rx_count;
    }
    else
    {
      p_ep->xfer_length = 0U;
    }

    if (p_ep->xfer_length == 0U)
    {
      /* Set NAK on the current endpoint */
      USB_DRD_PCD_SET_EP_RX_STATUS((uint32_t)p_usb, phy_ep_num, USB_EP_RX_NAK);
    }

    /* Need to FreeUser Buffer */
    if ((ep_value & USB_EP_DTOGTX) == 0U)
    {
      /* OUT double buffered endpoint */
      USB_DRD_TX_DTOG((uint32_t)p_usb, phy_ep_num);
    }

    if (rx_count != 0U)
    {
      USB_DRD_ReadPMA((uint32_t)p_usb, p_ep->p_xfer_buffer, p_ep->pma_addr1, rx_count);
    }
  }

  return rx_count;
}

/**
  * @brief  Manage double buffer bulk IN transaction from ISR.
  * @param  hpcd PCD handle
  * @param  p_ep current endpoint handle
  * @param  ep_value Last snapshot of EPRx register value taken in ISR
  * @retval HAL status
  */
static hal_status_t HAL_PCD_EP_DB_Transmit(hal_pcd_handle_t *hpcd, hal_pcd_ep_t *p_ep, uint16_t ep_value)
{
  const usb_drd_global_t *p_usb;
  uint32_t length;
  uint16_t tx_packet_size;
  usb_core_phy_ep_t phy_ep_num;

  ASSERT_DBG_PARAM((hpcd != NULL));
  ASSERT_DBG_PARAM((p_ep != NULL));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if ((hpcd == NULL) || (p_ep == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  p_usb = USB_DRD_GET_INSTANCE((uint32_t)hpcd->instance);

  /* Data Buffer0 ACK received */
  if ((ep_value & USB_EP_DTOGTX) != 0U)
  {
    /* Multi-packet on the NON control IN endpoint */
    tx_packet_size = (uint16_t)USB_DRD_PCD_GET_EP_DBUF0_CNT((uint32_t)p_usb, phy_ep_num);

    if (p_ep->xfer_length > tx_packet_size)
    {
      p_ep->xfer_length -= tx_packet_size;
    }
    else
    {
      p_ep->xfer_length = 0U;
    }

    /* Transfer is completed */
    if (p_ep->xfer_length == 0U)
    {
      USB_DRD_PCD_SET_EP_DBUF0_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, 0U);
      USB_DRD_PCD_SET_EP_DBUF1_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, 0U);

      if (p_ep->type == USB_CORE_EP_TYPE_BULK)
      {
        /* Set Bulk endpoint in NAK state */
        USB_DRD_PCD_SET_EP_TX_STATUS((uint32_t)p_usb, phy_ep_num, USB_EP_TX_NAK);
      }

      /* TX COMPLETE */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_data_in_stage_cb(hpcd, p_ep->num);
#else
      HAL_PCD_DataInStageCallback(hpcd, p_ep->num);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

      if ((ep_value & USB_EP_DTOGRX) != 0U)
      {
        /* IN double buffered endpoint */
        USB_DRD_RX_DTOG((uint32_t)p_usb, phy_ep_num);
      }

      return HAL_OK;
    }
    else /* Transfer is not yet Done */
    {
      /* Need to Free USB Buffer */
      if ((ep_value & USB_EP_DTOGRX) != 0U)
      {
        /* IN double buffered endpoint */
        USB_DRD_RX_DTOG((uint32_t)p_usb, phy_ep_num);
      }

      /* Still there is data to Fill in the next Buffer */
      if (p_ep->xfer_fill_db == 1U)
      {
        p_ep->p_xfer_buffer += tx_packet_size;
        p_ep->xfer_count += tx_packet_size;

        /* Calculate the length of the new buffer to fill */
        if (p_ep->xfer_size >= p_ep->max_packet)
        {
          length = p_ep->max_packet;
          p_ep->xfer_size -= length;
        }
        else if (p_ep->xfer_size == 0U)
        {
          length = tx_packet_size;
          p_ep->xfer_fill_db = 0U;
        }
        else
        {
          p_ep->xfer_fill_db = 0U;
          length = p_ep->xfer_size;
          p_ep->xfer_size = 0U;
        }

        /* Write remaining Data to Buffer */
        /* Set the Double buffer counter for pma buffer0 */
        USB_DRD_PCD_SET_EP_DBUF0_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, length);

        /* Copy user buffer to USB PMA */
        USB_DRD_WritePMA((uint32_t)p_usb, p_ep->p_xfer_buffer, p_ep->pma_addr0, (uint16_t)length);
      }
    }
  }
  else /* Data Buffer1 ACK received */
  {
    /* multi-packet on the NON control IN endpoint */
    tx_packet_size = (uint16_t)USB_DRD_PCD_GET_EP_DBUF1_CNT((uint32_t)p_usb, phy_ep_num);

    if (p_ep->xfer_length >= tx_packet_size)
    {
      p_ep->xfer_length -= tx_packet_size;
    }
    else
    {
      p_ep->xfer_length = 0U;
    }

    /* Transfer is completed */
    if (p_ep->xfer_length == 0U)
    {
      USB_DRD_PCD_SET_EP_DBUF0_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, 0U);
      USB_DRD_PCD_SET_EP_DBUF1_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, 0U);

      if (p_ep->type == USB_CORE_EP_TYPE_BULK)
      {
        /* Set Bulk endpoint in NAK state */
        USB_DRD_PCD_SET_EP_TX_STATUS((uint32_t)p_usb, phy_ep_num, USB_EP_TX_NAK);
      }

      /* TX COMPLETE */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->p_data_in_stage_cb(hpcd, p_ep->num);
#else
      HAL_PCD_DataInStageCallback(hpcd, p_ep->num);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

      /* Need to Free USB Buff */
      if ((ep_value & USB_EP_DTOGRX) == 0U)
      {
        /* IN double buffered endpoint */
        USB_DRD_RX_DTOG((uint32_t)p_usb, phy_ep_num);
      }

      return HAL_OK;
    }
    else /* Transfer is not yet Done */
    {
      /* Need to Free USB Buffer */
      if ((ep_value & USB_EP_DTOGRX) == 0U)
      {
        /* IN double buffered endpoint */
        USB_DRD_RX_DTOG((uint32_t)p_usb, phy_ep_num);
      }

      /* Still there is data to Fill in the next Buffer */
      if (p_ep->xfer_fill_db == 1U)
      {
        p_ep->p_xfer_buffer += tx_packet_size;
        p_ep->xfer_count += tx_packet_size;

        /* Calculate the length of the new buffer to fill */
        if (p_ep->xfer_size >= p_ep->max_packet)
        {
          length = p_ep->max_packet;
          p_ep->xfer_size -= length;
        }
        else if (p_ep->xfer_size == 0U)
        {
          length = tx_packet_size;
          p_ep->xfer_fill_db = 0U;
        }
        else
        {
          length = p_ep->xfer_size;
          p_ep->xfer_size = 0U;
          p_ep->xfer_fill_db = 0U;
        }

        /* Set the Double buffer counter for pma buffer1 */
        USB_DRD_PCD_SET_EP_DBUF1_CNT((uint32_t)p_usb, phy_ep_num, p_ep->dir, length);

        /* Copy the user buffer to USB PMA */
        USB_DRD_WritePMA((uint32_t)p_usb, p_ep->p_xfer_buffer, p_ep->pma_addr1, (uint16_t)length);
      }
    }
  }

  /* Enable endpoint IN */
  USB_DRD_PCD_SET_EP_TX_STATUS((uint32_t)p_usb, phy_ep_num, USB_EP_TX_VALID);

  return HAL_OK;
}
#endif /* defined (USE_HAL_PCD_USB_DOUBLE_BUFFER) && (USE_HAL_PCD_USB_DOUBLE_BUFFER == 1) */


/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (USE_HAL_PCD_MODULE) && (USE_HAL_PCD_MODULE == 1) */
#endif /* defined (USB_DRD_FS) */

/**
  * @}
  */
